demos/planarPoiseuille/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       39;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       79;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       119;
    }
    centreline
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1;
        startFace       120;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80;
        startFace       121;
    }
)

// ************************************************************************* //
